# Ultralytics YOLOv8-seg + SEA (Squeeze-and-Excitation) — SepSAM Agent model
# 基於官方 yolov8-seg.yaml；僅將 backbone 的 4 個 C2f 換成 C2f_SEA（論文：SEA 加在 backbone 的 C2f）。
# head 的 C2f 維持原樣（論文文字只提 backbone；如需也加到 head，可自行把 head 的 C2f 改成 C2f_SEA）。
#
# 使用前提：必須先執行 sea_setup.py，讓 ultralytics 認得 C2f_SEA（見附錄 C）。
# 檔名含 'n' → ultralytics 會自動套用 n 尺度。要用 x，把本檔複製成 yolov8x-seg-sea.yaml 即可（內容相同）。

nc: 1                       # 類別數：crack（單類）
scales:                     # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f_SEA, [128, True]]    # 2          <-- SEA
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f_SEA, [256, True]]    # 4          <-- SEA
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f_SEA, [512, True]]    # 6          <-- SEA
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f_SEA, [1024, True]]   # 8          <-- SEA
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # 11  cat backbone P4
  - [-1, 3, C2f, [512]]              # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # 14  cat backbone P3
  - [-1, 3, C2f, [256]]              # 15  (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # 17  cat head P4
  - [-1, 3, C2f, [512]]              # 18  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]        # 20  cat head P5
  - [-1, 3, C2f, [1024]]             # 21  (P5/32-large)

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]   # 22  Segment(P3, P4, P5)
